app/views/users/profile.html.erb

  <h2>Open Projects</h2>
    <% @current_user.projects.each do |project| %>
---
SELECT "projects".* FROM "projects" INNER JOIN "assignments" ON "projects"."id" = "assignments"."project_id" WHERE "assignments"."user_id" = $1  [["user_id", 1]]