app/views/projects/show.html.erb

  <strong>Coders:</strong>
  <% @project.users.each do |user| %>
---
SELECT "users".* FROM "users" INNER JOIN "assignments" ON "users"."id" = "assignments"."user_id" WHERE "assignments"."project_id" = $1  [["project_id", 1]]


  <% if user_signed_in? && Assignment.where(project_id: params[:id], user_id: current_user.id).empty?%>
---
SELECT COUNT(*) FROM "assignments" WHERE "assignments"."project_id" = $1 AND "assignments"."user_id" = $2  [["project_id", 1], ["user_id", 1]]