app/controllers/api/v1/assignments_controller.rb

  def create
    body=request.body.read
    parsed=JSON.parse(body)
    assignment = Assignment.new(parsed)
    assignment.user_id = current_user.id
    if assignment.save
---
INSERT INTO "assignments" ("project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 15], ["user_id", 10], ["created_at", 2017-05-10 03:19:01 UTC], ["updated_at", 2017-05-10 03:19:01 UTC]]