app/controllers/api/v1/projects_controller.rb

  def index
    projects = Project.all
---
SELECT "projects".* FROM "projects"

  def create
    body=request.body.read
    parsed=JSON.parse(body)
    project=Project.new(parsed)
    project.owner_id = current_user.id
    if project.save
---
INSERT INTO "projects" ("title", "description", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"