app/controllers/api/v1/searches_controller.rb

  def create
    @projects=Project.all
    if params[:search]
      search=params[:search]
      @projects=Project.where("title ilike ?", "%#{search}%")
---
SELECT "projects".* FROM "projects" WHERE (title description ilike '%%')
SELECT "projects".* FROM "projects" WHERE "projects"."title" = $1  [["title", ""]]