app/controllers/chatrooms_controller.rb

SELECT "chatrooms".* FROM "chatrooms"
---
  def index
    @chatroom=Chatroom.new
    @chatrooms=Chatroom.all

SELECT  "chatrooms".* FROM "chatrooms" ORDER BY "chatrooms"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT COUNT(*) FROM "chatrooms"
INSERT INTO "chatrooms" ("topic", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["topic", "test 2"], ["slug", "4"], ["created_at", 2017-05-11 17:42:52 UTC], ["updated_at", 2017-05-11 17:42:52 UTC]]
---
  def create
    @chatroom = Chatroom.new(chatroom_params)
    if Chatroom.all.empty?
      last_number = 0
    else
      last_number=Chatroom.last.id
    end
    @chatroom.slug = last_number + 1
    if @chatroom.save

SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."slug" = $1 LIMIT $2  [["slug", "1"], ["LIMIT", 1]]
---
  def show
    @chatroom = Chatroom.find_by(slug: params[:slug])